alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4300.svd
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!--
 *********************************************************************************************************************
 * Copyright (c) 2016, Infineon Technologies AG
 * All rights reserved.                        
 *                                             
 * Redistribution and use in source and binary forms, with or without modification,are permitted provided that the 
 * following conditions are met:   
 *                                                                              
 * Redistributions of source code must retain the above copyright notice, this list of conditions and the following 
 * disclaimer.                        
 * 
 * Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following 
 * disclaimer in the documentation and/or other materials provided with the distribution.                       
 * 
 * Neither the name of the copyright holders nor the names of its contributors may be used to endorse or promote 
 * products derived from this software without specific prior written permission.                                           
 *                                                                              
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, 
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE  
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE  FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR  
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
 * WHETHER IN CONTRACT, STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.                                                  
 *                                                                              
 * To improve the quality of the software, users are encouraged to share modifications, enhancements or bug fixes with 
 * Infineon Technologies AG dave@infineon.com).                                                          
 ********************************************************************************************************************* 
-->
<!-- edited with XMLSpy v2015 sp2 (http://www.altova.com) by Infineon Technologies AG (Infineon Technologies AG) -->
<!--Release Notes-->
<!--V1.1.0
- Formal update to match latest reference manual version number
- No register changes occured
-->
<!--Release History-->
<!--V1.0.4
- Add missing bit field DBYP to PCON register of PREF unit
- Removed SCU register CANCLKCR-->
<!--V1.0.3
- Corrected address offset of SCU registers CCUCLKCR, WDTCLKCR, EXTCLKCR, MLINKCLKCR, SLEEPCR, DSLEEPCR, ECATCLKCR, CANCLKCR-->
<!--V1.0.2
- Added missing SDMMCDEL register-->
<!--V1.0.1
- Added missing CGATSTAT1 register-->
<!--V1.0.0 
- is the first version for Reference Manual V1.-->
<!--V0.5.1
- Added service request information to "interrupt" elements-->
<!--V0.5.0 
- first version derived from superset device XMC4800 SVD v1.1.2-->
<!--Differences to Reference Manual

- Extended grouping not existing in RM for following units:
  GPDMA -> GPDMA, GPDMA_CH
  FCE -> FCE, FCE_KE
  SCU -> many sub-groups
  USB -> USB, USB_EP, USB_NODE
  CAN -> CAN, CAN_NODE, CAN_MO
  VADC -> VADC, VADC_G
  DSD -> DSD, DSD_CH
  CCU4 -> CCU4, CCU4_CC4
  CCU8 -> CCU8, CCU8_CC8
- CAN registers MOCTR/MOSTAT and LIST reset values removed and masked out
-->
<!--Compliance
- CMSIS-SVD V1.2
- Tested with ARM CMSIS-SVD SVD Consistency Checker / Header File Generator V2.87g
-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.2" xs:noNamespaceSchemaLocation="c:\fm8_xml\XSLT\RD2ISFR\CMSIS-SVD.xsd">
	<vendor>Infineon</vendor>
	<name>XMC4300</name>
	<version>1.1.0 (Reference Manual v1.1)</version>
	<description>SVD file</description>
	<cpu>
		<name>CM4</name>
		<revision>r2p0</revision>
		<endian>little</endian>
		<mpuPresent>true</mpuPresent>
		<fpuPresent>true</fpuPresent>
		<nvicPrioBits>6</nvicPrioBits>
		<vendorSystickConfig>false</vendorSystickConfig>
	</cpu>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<peripherals>
		<peripheral>
			<name>PPB</name>
			<description>Cortex-M4 Private Peripheral Block</description>
			<baseAddress>0xE000E000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ACTLR</name>
					<description>Auxiliary Control Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DISMCYCINT</name>
							<description>Disable load/store multiple</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISDEFWBUF</name>
							<description>Disable write buffer</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISFOLD</name>
							<description>Disable IT folding</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISFPCA</name>
							<description>Disable FPCA update</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>DISOOFP</name>
							<description>Disable out of order FP execution</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYST_CSR</name>
					<description>SysTick Control and Status Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<resetValue>0x00000004</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENABLE</name>
							<description>Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>counter disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>counter enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TICKINT</name>
							<description>Tick Interrupt Enable</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>counting down to zero does not assert the SysTick exception request</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>counting down to zero to asserts the SysTick exception request.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKSOURCE</name>
							<description>Indicates the clock source:</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>external clock</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>processor clock.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUNTFLAG</name>
							<description>Counter Flag</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYST_RVR</name>
					<description>SysTick Reload Value Register</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RELOAD</name>
							<description>Reload Value</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYST_CVR</name>
					<description>SysTick Current Value Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CURRENT</name>
							<description>Current Value</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYST_CALIB</name>
					<description>SysTick Calibration Value Register r</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<resetValue>0xC0000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TENMS</name>
							<description>Ten Milliseconds Reload Value</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SKEW</name>
							<description>Ten Milliseconds Skewed</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>TENMS value is exact</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>TENMS value is inexact, or not given.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>NOREF</name>
							<description>No Reference Clock</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>reference clock provided</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>no reference clock provided.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISER0</name>
					<description>Interrupt Set-enable Register 0</description>
					<addressOffset>0x100</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETENA</name>
							<description>Interrupt set-enable bits</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISER1</name>
					<description>Interrupt Set-enable Register 1</description>
					<addressOffset>0x104</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETENA</name>
							<description>Interrupt set-enable bits</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISER2</name>
					<description>Interrupt Set-enable Register 2</description>
					<addressOffset>0x108</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETENA</name>
							<description>Interrupt set-enable bits</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISER3</name>
					<description>Interrupt Set-enable Register 3</description>
					<addressOffset>0x10C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETENA</name>
							<description>Interrupt set-enable bits</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICER0</name>
					<description>Interrupt Clear-enable Register 0</description>
					<addressOffset>0x180</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRENA</name>
							<description>Interrupt clear-enable bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICER1</name>
					<description>Interrupt Clear-enable Register 1</description>
					<addressOffset>0x184</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRENA</name>
							<description>Interrupt clear-enable bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICER2</name>
					<description>Interrupt Clear-enable Register 2</description>
					<addressOffset>0x188</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRENA</name>
							<description>Interrupt clear-enable bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICER3</name>
					<description>Interrupt Clear-enable Register 3</description>
					<addressOffset>0x18C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRENA</name>
							<description>Interrupt clear-enable bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISPR0</name>
					<description>Interrupt Set-pending Register 0</description>
					<addressOffset>0x200</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETPEND</name>
							<description>Interrupt set-pending bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt is not pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt is pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISPR1</name>
					<description>Interrupt Set-pending Register 1</description>
					<addressOffset>0x204</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETPEND</name>
							<description>Interrupt set-pending bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt is not pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt is pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISPR2</name>
					<description>Interrupt Set-pending Register 2</description>
					<addressOffset>0x208</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETPEND</name>
							<description>Interrupt set-pending bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt is not pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt is pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISPR3</name>
					<description>Interrupt Set-pending Register 3</description>
					<addressOffset>0x20C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETPEND</name>
							<description>Interrupt set-pending bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt is not pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt is pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICPR0</name>
					<description>Interrupt Clear-pending Register 0</description>
					<addressOffset>0x280</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRPEND</name>
							<description>Interrupt set-pending bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt is not pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt is pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICPR1</name>
					<description>Interrupt Clear-pending Register 1</description>
					<addressOffset>0x284</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRPEND</name>
							<description>Interrupt set-pending bits.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value3</name>
									<description>interrupt is not pending</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>interrupt is pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
