alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4300.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SCU_OSC</name>
			<description>System Control Unit</description>
			<groupName>SCU</groupName>
			<baseAddress>0x50004700</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>OSCHPSTAT</name>
					<description>OSC_HP Status Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>X1D</name>
							<description>XTAL1 Data Value</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>OSCHPCTRL</name>
					<description>OSC_HP Control Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x0000003C</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>X1DEN</name>
							<description>XTAL1 Data Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>Bit X1D is not updated</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>Bit X1D can be updated</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SHBY</name>
							<description>Shaper Bypass</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>The shaper is not bypassed</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>The shaper is bypassed</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>GAINSEL</name>
							<description>Oscillator Gain Selection</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_00</name>
									<description>The gain control is configured for frequencies from 4 MHz to 8 MHz</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_01</name>
									<description>The gain control is configured for frequencies from 4 MHz to 16 MHz</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_10</name>
									<description>The gain control is configured for frequencies from 4 MHz to 20 MHz</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_11</name>
									<description>The gain control is configured for frequencies from 4 MHz to 25 MHz</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>MODE</name>
							<description>Oscillator Mode</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_00</name>
									<description>External Crystal Mode and External Input Clock Mode. The oscillator Power-Saving Mode is not entered.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_01</name>
									<description>OSC is disabled. The oscillator Power-Saving Mode is not entered.</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_10</name>
									<description>External Input Clock Mode and the oscillator Power-Saving Mode is entered</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_11</name>
									<description>OSC is disabled. The oscillator Power-Saving Mode is entered.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCVAL</name>
							<description>OSC Frequency Value</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CLKCALCONST</name>
					<description>Clock Calibration Constant Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CALIBCONST</name>
							<description>Clock Calibration Constant Value</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>SCU_PLL</name>
			<description>System Control Unit</description>
			<groupName>SCU</groupName>
			<baseAddress>0x50004710</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x38</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>PLLSTAT</name>
					<description>PLL Status Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00000002</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VCOBYST</name>
							<description>VCO Bypass Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>Free-running / Normal Mode is entered</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>Prescaler Mode is entered</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWDSTAT</name>
							<description>PLL Power-saving Mode Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>PLL Power-saving Mode was not entered</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>PLL Power-saving Mode was entered</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCOLOCK</name>
							<description>PLL LOCK Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>PLL not locked</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>PLL locked</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>K1RDY</name>
							<description>K1 Divider Ready Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>K1-Divider does not operate with the new value</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>K1-Divider operate with the new value</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>K2RDY</name>
							<description>K2 Divider Ready Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>K2-Divider does not operate with the new value</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>K2-Divider operate with the new value</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BY</name>
							<description>Bypass Mode Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>Bypass Mode is not entered</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>Bypass Mode is entered. Input fOSC is selected as output fPLL.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PLLLV</name>
							<description>Oscillator for PLL Valid Low Status Bit</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>The OSC frequency is not usable. Frequency fREF is too low.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>The OSC frequency is usable</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PLLHV</name>
							<description>Oscillator for PLL Valid High Status Bit</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>The OSC frequency is not usable. Frequency fOSC is too high.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>The OSC frequency is usable</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PLLSP</name>
							<description>Oscillator for PLL Valid Spike Status Bit</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>The OSC frequency is not usable. Spikes are detected that disturb a locked operation</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>The OSC frequency is usable</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PLLCON0</name>
					<description>PLL Configuration 0 Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x00030003</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VCOBYP</name>
							<description>VCO Bypass</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>Normal operation, VCO is not bypassed</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>Prescaler Mode, VCO is bypassed</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCOPWD</name>
							<description>VCO Power Saving Mode</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>Normal behavior</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>The VCO is put into a Power Saving Mode and can no longer be used. Only the Bypass and Prescaler Mode are active if previously selected.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCOTR</name>
							<description>VCO Trim Control</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>VCO bandwidth is operation in the normal range. VCO output frequency is between 260 and 520 MHz for a input frequency between 8 and 16 MHz.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>VCO bandwidth is operation in the test range. VCO output frequency is between 260 and 520 MHz for a input frequency between 8 and 16 MHz.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FINDIS</name>
							<description>Disconnect Oscillator from VCO</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>connect oscillator to the VCO part</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>disconnect oscillator from the VCO part.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCDISCDIS</name>
							<description>Oscillator Disconnect Disable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>In case of a PLL loss-of-lock bit FINDIS is set</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>In case of a PLL loss-of-lock bit FINDIS is cleared</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PLLPWD</name>
							<description>PLL Power Saving Mode</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>Normal behavior</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>The complete PLL block is put into a Power Saving Mode and can no longer be used. Only the Bypass Mode is active if previously selected.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>OSCRES</name>
							<description>Oscillator Watchdog Reset</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>The Oscillator Watchdog of the PLL is not reset and remains active</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>The Oscillator Watchdog of the PLL is reset</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESLD</name>
							<description>Restart VCO Lock Detection</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>AOTREN</name>
							<description>Automatic Oscillator Calibration Enable</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>Disable</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>Enable</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FOTR</name>
							<description>Factory Oscillator Calibration</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>No effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>Force fixed-value trimming</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PLLCON1</name>
					<description>PLL Configuration 1 Register</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>K1DIV</name>
							<description>K1-Divider Value</description>
							<lsb>0</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NDIV</name>
							<description>N-Divider Value</description>
							<lsb>8</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>K2DIV</name>
							<description>K2-Divider Value</description>
							<lsb>16</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PDIV</name>
							<description>P-Divider Value</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PLLCON2</name>
					<description>PLL Configuration 2 Register</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x00000001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PINSEL</name>
							<description>P-Divider Input Selection</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>PLL external oscillator selected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>Backup clock fofi selected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>K1INSEL</name>
							<description>K1-Divider Input Selection</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>PLL external oscillator selected</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>Backup clock fofi selected</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>USBPLLSTAT</name>
					<description>USB PLL Status Register</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000002</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VCOBYST</name>
							<description>VCO Bypass Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>Normal Mode is entered</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>Prescaler Mode is entered</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PWDSTAT</name>
							<description>PLL Power-saving Mode Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>PLL Power-saving Mode was not entered</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>PLL Power-saving Mode was entered</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCOLOCK</name>
							<description>PLL VCO Lock Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>The frequency difference of fREF and fDIV is greater than allowed. The VCO part of the PLL can not lock on a target frequency.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>The frequency difference of fREF and fDIV is small enough to enable a stable VCO operation</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BY</name>
							<description>Bypass Mode Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>Bypass Mode is not entered</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>Bypass Mode is entered. Input fOSC is selected as output fPLL.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VCOLOCKED</name>
							<description>PLL LOCK Status</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>Const_0</name>
									<description>PLL not locked</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>Const_1</name>
									<description>PLL locked</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
