alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4300.svd
				<register>
					<name>MMC_TRANSMIT_INTERRUPT_MASK</name>
					<description>MMC Transmit Interrupt Mask Register</description>
					<addressOffset>0x0110</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXGBOCTIM</name>
							<description>MMC Transmit Good Bad Octet Counter Interrupt Mask</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXGBFRMIM</name>
							<description>MMC Transmit Good Bad Frame Counter Interrupt Mask</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXBCGFIM</name>
							<description>MMC Transmit Broadcast Good Frame Counter Interrupt Mask</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXMCGFIM</name>
							<description>MMC Transmit Multicast Good Frame Counter Interrupt Mask</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX64OCTGBFIM</name>
							<description>MMC Transmit 64 Octet Good Bad Frame Counter Interrupt Mask</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX65T127OCTGBFIM</name>
							<description>MMC Transmit 65 to 127 Octet Good Bad Frame Counter Interrupt Mask</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX128T255OCTGBFIM</name>
							<description>MMC Transmit 128 to 255 Octet Good Bad Frame Counter Interrupt Mask</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX256T511OCTGBFIM</name>
							<description>MMC Transmit 256 to 511 Octet Good Bad Frame Counter Interrupt Mask</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX512T1023OCTGBFIM</name>
							<description>MMC Transmit 512 to 1023 Octet Good Bad Frame Counter Interrupt Mask</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TX1024TMAXOCTGBFIM</name>
							<description>MMC Transmit 1024 to Maximum Octet Good Bad Frame Counter Interrupt Mask</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXUCGBFIM</name>
							<description>MMC Transmit Unicast Good Bad Frame Counter Interrupt Mask</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXMCGBFIM</name>
							<description>MMC Transmit Multicast Good Bad Frame Counter Interrupt Mask</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXBCGBFIM</name>
							<description>MMC Transmit Broadcast Good Bad Frame Counter Interrupt Mask</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXUFLOWERFIM</name>
							<description>MMC Transmit Underflow Error Frame Counter Interrupt Mask</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXSCOLGFIM</name>
							<description>MMC Transmit Single Collision Good Frame Counter Interrupt Mask</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXMCOLGFIM</name>
							<description>MMC Transmit Multiple Collision Good Frame Counter Interrupt Mask</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXDEFFIM</name>
							<description>MMC Transmit Deferred Frame Counter Interrupt Mask</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXLATCOLFIM</name>
							<description>MMC Transmit Late Collision Frame Counter Interrupt Mask</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXEXCOLFIM</name>
							<description>MMC Transmit Excessive Collision Frame Counter Interrupt Mask</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXCARERFIM</name>
							<description>MMC Transmit Carrier Error Frame Counter Interrupt Mask</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXGOCTIM</name>
							<description>MMC Transmit Good Octet Counter Interrupt Mask</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXGFRMIM</name>
							<description>MMC Transmit Good Frame Counter Interrupt Mask</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXEXDEFFIM</name>
							<description>MMC Transmit Excessive Deferral Frame Counter Interrupt Mask</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXPAUSFIM</name>
							<description>MMC Transmit Pause Frame Counter Interrupt Mask</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXVLANGFIM</name>
							<description>MMC Transmit VLAN Good Frame Counter Interrupt Mask</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TXOSIZEGFIM</name>
							<description>MMC Transmit Oversize Good Frame Counter Interrupt Mask</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_OCTET_COUNT_GOOD_BAD</name>
					<description>Transmit Octet Count for Good and Bad Frames Register</description>
					<addressOffset>0x0114</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXOCTGB</name>
							<description>This field indicates the number of bytes transmitted in good and bad frames exclusive of preamble and retried bytes.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_FRAME_COUNT_GOOD_BAD</name>
					<description>Transmit Frame Count for Goodand Bad Frames Register</description>
					<addressOffset>0x0118</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXFRMGB</name>
							<description>This field indicates the number of good and bad frames transmitted, exclusive of retried frames</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_BROADCAST_FRAMES_GOOD</name>
					<description>Transmit Frame Count for Good Broadcast Frames</description>
					<addressOffset>0x011C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXBCASTG</name>
							<description>This field indicates the number of transmitted good broadcast frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_MULTICAST_FRAMES_GOOD</name>
					<description>Transmit Frame Count for Good Multicast Frames</description>
					<addressOffset>0x0120</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXMCASTG</name>
							<description>This field indicates the number of transmitted good multicast frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_64OCTETS_FRAMES_GOOD_BAD</name>
					<description>Transmit Octet Count for Good and Bad 64 Byte Frames</description>
					<addressOffset>0x0124</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TX64OCTGB</name>
							<description>This field indicates the number of transmitted good and bad frames with length of 64 bytes, exclusive of preamble and retried frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_65TO127OCTETS_FRAMES_GOOD_BAD</name>
					<description>Transmit Octet Count for Good and Bad 65 to 127 Bytes Frames</description>
					<addressOffset>0x0128</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TX65_127OCTGB</name>
							<description>This field indicates the number of transmitted good and bad frames with length between 65 and 127 (inclusive) bytes, exclusive of preamble and retried frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_128TO255OCTETS_FRAMES_GOOD_BAD</name>
					<description>Transmit Octet Count for Good and Bad 128 to 255 Bytes Frames</description>
					<addressOffset>0x012C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TX128_255OCTGB</name>
							<description>This field indicates the number of transmitted good and bad frames with length between 128 and 255 (inclusive) bytes, exclusive of preamble and retried frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_256TO511OCTETS_FRAMES_GOOD_BAD</name>
					<description>Transmit Octet Count for Good and Bad 256 to 511 Bytes Frames</description>
					<addressOffset>0x0130</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TX256_511OCTGB</name>
							<description>This field indicates the number of transmitted good and bad frames with length between 256 and 511 (inclusive) bytes, exclusive of preamble and retried frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_512TO1023OCTETS_FRAMES_GOOD_BAD</name>
					<description>Transmit Octet Count for Good and Bad 512 to 1023 Bytes Frames</description>
					<addressOffset>0x0134</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TX512_1023OCTGB</name>
							<description>This field indicates the number of transmitted good and bad frames with length between 512 and 1,023 (inclusive) bytes, exclusive of preamble and retried frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_1024TOMAXOCTETS_FRAMES_GOOD_BAD</name>
					<description>Transmit Octet Count for Good and Bad 1024 to Maxsize Bytes Frames</description>
					<addressOffset>0x0138</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TX1024_MAXOCTGB</name>
							<description>This field indicates the number of good and bad frames transmitted with length between 1,024 and maxsize (inclusive) bytes, exclusive of preamble and retried frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_UNICAST_FRAMES_GOOD_BAD</name>
					<description>Transmit Frame Count for Good and Bad Unicast Frames</description>
					<addressOffset>0x013C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXUCASTGB</name>
							<description>This field indicates the number of transmitted good and bad unicast frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_MULTICAST_FRAMES_GOOD_BAD</name>
					<description>Transmit Frame Count for Good and Bad Multicast Frames</description>
					<addressOffset>0x0140</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXMCASTGB</name>
							<description>This field indicates the number of transmitted good and bad multicast frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_BROADCAST_FRAMES_GOOD_BAD</name>
					<description>Transmit Frame Count for Good and Bad Broadcast Frames</description>
					<addressOffset>0x0144</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXBCASTGB</name>
							<description>This field indicates the number of transmitted good and bad broadcast frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_UNDERFLOW_ERROR_FRAMES</name>
					<description>Transmit Frame Count for Underflow Error Frames</description>
					<addressOffset>0x0148</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXUNDRFLW</name>
							<description>This field indicates the number of frames aborted because of frame underflow error.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_SINGLE_COLLISION_GOOD_FRAMES</name>
					<description>Transmit Frame Count for Frames Transmitted after Single Collision</description>
					<addressOffset>0x014C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXSNGLCOLG</name>
							<description>This field indicates the number of successfully transmitted frames after a single collision in the half-duplex mode.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_MULTIPLE_COLLISION_GOOD_FRAMES</name>
					<description>Transmit Frame Count for Frames Transmitted after Multiple Collision</description>
					<addressOffset>0x0150</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXMULTCOLG</name>
							<description>This field indicates the number of successfully transmitted frames after multiple collisions in the half-duplex mode.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_DEFERRED_FRAMES</name>
					<description>Tx Deferred Frames Register</description>
					<addressOffset>0x0154</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXDEFRD</name>
							<description>This field indicates the number of successfully transmitted frames after a deferral in the half-duplex mode.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_LATE_COLLISION_FRAMES</name>
					<description>Transmit Frame Count for Late Collision Error Frames</description>
					<addressOffset>0x0158</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXLATECOL</name>
							<description>This field indicates the number of frames aborted because of late collision error.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_EXCESSIVE_COLLISION_FRAMES</name>
					<description>Transmit Frame Count for Excessive Collision Error Frames</description>
					<addressOffset>0x015C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXEXSCOL</name>
							<description>This field indicates the number of frames aborted because of excessive (16) collision error.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_CARRIER_ERROR_FRAMES</name>
					<description>Transmit Frame Count for Carrier Sense Error Frames</description>
					<addressOffset>0x0160</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXCARR</name>
							<description>This field indicates the number of frames aborted because of carrier sense error (no carrier or loss of carrier).</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_OCTET_COUNT_GOOD</name>
					<description>Tx Octet Count Good Register</description>
					<addressOffset>0x0164</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXOCTG</name>
							<description>This field indicates the number of bytes transmitted, exclusive of preamble, in good frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_FRAME_COUNT_GOOD</name>
					<description>Tx Frame Count Good Register</description>
					<addressOffset>0x0168</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXFRMG</name>
							<description>This field indicates the number of transmitted good frames, exclusive of preamble.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_EXCESSIVE_DEFERRAL_ERROR</name>
					<description>Transmit Frame Count for Excessive Deferral Error Frames</description>
					<addressOffset>0x016C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXEXSDEF</name>
							<description>This field indicates the number of frames aborted because of excessive deferral error, that is, frames deferred for more than two max-sized frame times.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_PAUSE_FRAMES</name>
					<description>Transmit Frame Count for Good PAUSE Frames</description>
					<addressOffset>0x0170</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXPAUSE</name>
							<description>This field indicates the number of transmitted good PAUSE frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_VLAN_FRAMES_GOOD</name>
					<description>Transmit Frame Count for Good VLAN Frames</description>
					<addressOffset>0x0174</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXVLANG</name>
							<description>This register maintains the number of transmitted good VLAN frames, exclusive of retried frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>TX_OSIZE_FRAMES_GOOD</name>
					<description>Transmit Frame Count for Good Oversize Frames</description>
					<addressOffset>0x0178</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TXOSIZG</name>
							<description>This field indicates the number of frames transmitted without errors and with length greater than the maxsize (1,518 or 1,522 bytes for VLAN tagged frames; 2000 bytes if enabled by setting MAC Configuration.2KPE).</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_FRAMES_COUNT_GOOD_BAD</name>
					<description>Receive Frame Count for Good and Bad Frames</description>
					<addressOffset>0x0180</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXFRMGB</name>
							<description>This field indicates the number of received good and bad frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_OCTET_COUNT_GOOD_BAD</name>
					<description>Receive Octet Count for Good and Bad Frames</description>
					<addressOffset>0x0184</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXOCTGB</name>
							<description>This field indicates the number of bytes received, exclusive of preamble, in good and bad frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RX_OCTET_COUNT_GOOD</name>
					<description>Rx Octet Count Good Register</description>
					<addressOffset>0x0188</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXOCTG</name>
							<description>This field indicates the number of bytes received, exclusive of preamble, only in good frames.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
