alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4300.svd
				<register>
					<name>MMC_IPC_RECEIVE_INTERRUPT</name>
					<description>MMC Receive Checksum Offload Interrupt Register</description>
					<addressOffset>0x0208</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV4GFIS</name>
							<description>MMC Receive IPV4 Good Frame Counter Interrupt Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4HERFIS</name>
							<description>MMC Receive IPV4 Header Error Frame Counter Interrupt Status</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4NOPAYFIS</name>
							<description>MMC Receive IPV4 No Payload Frame Counter Interrupt Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4FRAGFIS</name>
							<description>MMC Receive IPV4 Fragmented Frame Counter Interrupt Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4UDSBLFIS</name>
							<description>MMC Receive IPV4 UDP Checksum Disabled Frame Counter Interrupt Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV6GFIS</name>
							<description>MMC Receive IPV6 Good Frame Counter Interrupt Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV6HERFIS</name>
							<description>MMC Receive IPV6 Header Error Frame Counter Interrupt Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV6NOPAYFIS</name>
							<description>MMC Receive IPV6 No Payload Frame Counter Interrupt Status</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXUDPGFIS</name>
							<description>MMC Receive UDP Good Frame Counter Interrupt Status</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXUDPERFIS</name>
							<description>MMC Receive UDP Error Frame Counter Interrupt Status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTCPGFIS</name>
							<description>MMC Receive TCP Good Frame Counter Interrupt Status</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTCPERFIS</name>
							<description>MMC Receive TCP Error Frame Counter Interrupt Status</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXICMPGFIS</name>
							<description>MMC Receive ICMP Good Frame Counter Interrupt Status</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXICMPERFIS</name>
							<description>MMC Receive ICMP Error Frame Counter Interrupt Status</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4GOIS</name>
							<description>MMC Receive IPV4 Good Octet Counter Interrupt Status</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4HEROIS</name>
							<description>MMC Receive IPV4 Header Error Octet Counter Interrupt Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4NOPAYOIS</name>
							<description>MMC Receive IPV4 No Payload Octet Counter Interrupt Status</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4FRAGOIS</name>
							<description>MMC Receive IPV4 Fragmented Octet Counter Interrupt Status</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV4UDSBLOIS</name>
							<description>MMC Receive IPV4 UDP Checksum Disabled Octet Counter Interrupt Status</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV6GOIS</name>
							<description>MMC Receive IPV6 Good Octet Counter Interrupt Status</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV6HEROIS</name>
							<description>MMC Receive IPV6 Header Error Octet Counter Interrupt Status</description>
							<lsb>22</lsb>
							<msb>22</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXIPV6NOPAYOIS</name>
							<description>MMC Receive IPV6 No Payload Octet Counter Interrupt Status</description>
							<lsb>23</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXUDPGOIS</name>
							<description>MMC Receive UDP Good Octet Counter Interrupt Status</description>
							<lsb>24</lsb>
							<msb>24</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXUDPEROIS</name>
							<description>MMC Receive UDP Error Octet Counter Interrupt Status</description>
							<lsb>25</lsb>
							<msb>25</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTCPGOIS</name>
							<description>MMC Receive TCP Good Octet Counter Interrupt Status</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXTCPEROIS</name>
							<description>MMC Receive TCP Error Octet Counter Interrupt Status</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXICMPGOIS</name>
							<description>MMC Receive ICMP Good Octet Counter Interrupt Status</description>
							<lsb>28</lsb>
							<msb>28</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>RXICMPEROIS</name>
							<description>MMC Receive ICMP Error Octet Counter Interrupt Status</description>
							<lsb>29</lsb>
							<msb>29</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_GOOD_FRAMES</name>
					<description>RxIPv4 Good Frames Register</description>
					<addressOffset>0x0210</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV4GDFRM</name>
							<description>This field indicates the number of good IPv4 datagrams received with the TCP, UDP, or ICMP payload.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_HEADER_ERROR_FRAMES</name>
					<description>Receive IPV4 Header Error Frame Counter Register</description>
					<addressOffset>0x0214</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV4HDRERRFRM</name>
							<description>This field indicates the number of IPv4 datagrams received with header errors (checksum, length, or version mismatch).</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_NO_PAYLOAD_FRAMES</name>
					<description>Receive IPV4 No Payload Frame Counter Register</description>
					<addressOffset>0x0218</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV4NOPAYFRM</name>
							<description>This field indicates the number of IPv4 datagram frames received that did not have a TCP, UDP, or ICMP payload processed by the Checksum engine.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_FRAGMENTED_FRAMES</name>
					<description>Receive IPV4 Fragmented Frame Counter Register</description>
					<addressOffset>0x021C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV4FRAGFRM</name>
							<description>This field indicates the number of good IPv4 datagrams received with fragmentation.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_UDP_CHECKSUM_DISABLED_FRAMES</name>
					<description>Receive IPV4 UDP Checksum Disabled Frame Counter Register</description>
					<addressOffset>0x0220</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV4UDSBLFRM</name>
							<description>This field indicates the number of received good IPv4 datagrams which have the UDP payload with checksum disabled.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV6_GOOD_FRAMES</name>
					<description>RxIPv6 Good Frames Register</description>
					<addressOffset>0x0224</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV6GDFRM</name>
							<description>This field indicates the number of good IPv6 datagrams received with TCP, UDP, or ICMP payloads.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV6_HEADER_ERROR_FRAMES</name>
					<description>Receive IPV6 Header Error Frame Counter Register</description>
					<addressOffset>0x0228</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV6HDRERRFRM</name>
							<description>This field indicates the number of IPv6 datagrams received with header errors (length or version mismatch).</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV6_NO_PAYLOAD_FRAMES</name>
					<description>Receive IPV6 No Payload Frame Counter Register</description>
					<addressOffset>0x022C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV6NOPAYFRM</name>
							<description>This field indicates the number of IPv6 datagram frames received that did not have a TCP, UDP, or ICMP payload. This includes all IPv6 datagrams with fragmentation or security extension headers.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXUDP_GOOD_FRAMES</name>
					<description>RxUDP Good Frames Register</description>
					<addressOffset>0x0230</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXUDPGDFRM</name>
							<description>This field indicates the number of good IP datagrams with a good UDP payload. This counter is not updated when the counter is incremented.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXUDP_ERROR_FRAMES</name>
					<description>RxUDP Error Frames Register</description>
					<addressOffset>0x0234</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXUDPERRFRM</name>
							<description>This field indicates the number of good IP datagrams whose UDP payload has a checksum error.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXTCP_GOOD_FRAMES</name>
					<description>RxTCP Good Frames Register</description>
					<addressOffset>0x0238</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXTCPGDFRM</name>
							<description>This field indicates the number of good IP datagrams with a good TCP payload.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXTCP_ERROR_FRAMES</name>
					<description>RxTCP Error Frames Register</description>
					<addressOffset>0x023C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXTCPERRFRM</name>
							<description>This field indicates the number of good IP datagrams whose TCP payload has a checksum error.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXICMP_GOOD_FRAMES</name>
					<description>RxICMP Good Frames Register</description>
					<addressOffset>0x0240</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXICMPGDFRM</name>
							<description>This field indicates the number of good IP datagrams with a good ICMP payload.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXICMP_ERROR_FRAMES</name>
					<description>RxICMP Error Frames Register</description>
					<addressOffset>0x0244</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXICMPERRFRM</name>
							<description>This field indicates the number of good IP datagrams whose ICMP payload has a checksum error.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_GOOD_OCTETS</name>
					<description>RxIPv4 Good Octets Register</description>
					<addressOffset>0x0250</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV4GDOCT</name>
							<description>This field indicates the number of bytes received in good IPv4 datagrams encapsulating TCP, UDP, or ICMP data. The Ethernet header, FCS, pad, or IP pad</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_HEADER_ERROR_OCTETS</name>
					<description>Receive IPV4 Header Error Octet Counter Register</description>
					<addressOffset>0x0254</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV4HDRERROCT</name>
							<description>This field indicates the number of bytes received in the IPv4 datagrams with header errors (checksum, length, or version mismatch). The value in the Length field of IPv4 header is used to update this counter.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_NO_PAYLOAD_OCTETS</name>
					<description>Receive IPV4 No Payload Octet Counter Register</description>
					<addressOffset>0x0258</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV4NOPAYOCT</name>
							<description>This field indicates the number of bytes received in IPv4 datagrams that did not have a TCP, UDP, or ICMP payload. The value in the IPv4 headers Length field is used to update this counter.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_FRAGMENTED_OCTETS</name>
					<description>Receive IPV4 Fragmented Octet Counter Register</description>
					<addressOffset>0x025C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV4FRAGOCT</name>
							<description>This field indicates the number of bytes received in fragmented IPv4 datagrams. The value in the IPv4 headers Length field is used to update this counter.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV4_UDP_CHECKSUM_DISABLE_OCTETS</name>
					<description>Receive IPV4 Fragmented Octet Counter Register</description>
					<addressOffset>0x0260</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV4UDSBLOCT</name>
							<description>This field indicates the number of bytes received in a UDP segment that had the UDP checksum disabled. This counter does not count the IP Header bytes. The Ethernet header, FCS, pad, or IP pad bytes are not included in this counter.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV6_GOOD_OCTETS</name>
					<description>RxIPv6 Good Octets Register</description>
					<addressOffset>0x0264</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV6GDOCT</name>
							<description>Thsi field indicates the number of bytes received in good IPv6 datagrams encapsulating TCP, UDP or ICMPv6 data.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV6_HEADER_ERROR_OCTETS</name>
					<description>Receive IPV6 Header Error Octet Counter Register</description>
					<addressOffset>0x0268</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV6HDRERROCT</name>
							<description>This field indicates the number of bytes received in IPv6 datagrams with header errors (length or version mismatch). The value in the IPv6 headers Length field is used to update this counter.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXIPV6_NO_PAYLOAD_OCTETS</name>
					<description>Receive IPV6 No Payload Octet Counter Register</description>
					<addressOffset>0x026C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXIPV6NOPAYOCT</name>
							<description>This field indicates the number of bytes received in IPv6 datagrams that did not have a TCP, UDP, or ICMP payload. The value in the IPv6 headers Length field is used to update this counter.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXUDP_GOOD_OCTETS</name>
					<description>Receive UDP Good Octets Register</description>
					<addressOffset>0x0270</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXUDPGDOCT</name>
							<description>This field indicates the number of bytes received in a good UDP segment. This counter does not count IP header bytes. The Ethernet header, FCS, pad, or IP pad bytes are not included in this counter.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXUDP_ERROR_OCTETS</name>
					<description>Receive UDP Error Octets Register</description>
					<addressOffset>0x0274</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXUDPERROCT</name>
							<description>This field indicates the number of bytes received in a UDP segment with checksum errors. This counter does not count the IP Header bytes. The Ethernet header, FCS, pad, or IP pad bytes are not included in this counter.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXTCP_GOOD_OCTETS</name>
					<description>Receive TCP Good Octets Register</description>
					<addressOffset>0x0278</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXTCPGDOCT</name>
							<description>This field indicates the number of bytes received in a good TCP segment. This counter does not count the IP Header bytes. The Ethernet header, FCS, pad, or IP pad bytes are not included in this counter.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXTCP_ERROR_OCTETS</name>
					<description>Receive TCP Error Octets Register</description>
					<addressOffset>0x027C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXTCPERROCT</name>
							<description>Thsi field indicates the number of bytes received in a TCP segment with checksum errors. This counter does not count the IP Header bytes. The Ethernet header, FCS, pad, or IP pad bytes are not included in this counter.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RXICMP_GOOD_OCTETS</name>
					<description>Receive ICMP Good Octets Register</description>
					<addressOffset>0x0280</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RXICMPGDOCT</name>
							<description>This field indicates the number of bytes received in a good ICMP segment. This counter does not count the IP Header bytes. The Ethernet header, FCS, pad, or IP pad bytes are not included in this counter.</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
