alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4300.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>ECAT0</name>
			<description>EtherCAT 0</description>
			<groupName>ECAT</groupName>
			<headerStructName>ECAT</headerStructName>
			<baseAddress>0x54010000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x010000</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>ECAT0_0</name>
				<description>EtherCAT (Module 0)</description>
				<value>109</value>
			</interrupt>
			<registers>
				<register>
					<name>TYPE</name>
					<description>Type of EtherCAT Controller</description>
					<addressOffset>0x0000</addressOffset>
					<size>8</size>
					<resetValue>0x98</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>Type</name>
							<description>Type of EtherCAT controller</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>REVISION</name>
					<description>Revision of EtherCAT Controller</description>
					<addressOffset>0x0001</addressOffset>
					<size>8</size>
					<resetValue>0x01</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>Revision</name>
							<description>Revision of EtherCAT controller</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>BUILD</name>
					<description>Build Version</description>
					<addressOffset>0x0002</addressOffset>
					<size>16</size>
					<resetValue>0x0001</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>BUILD</name>
							<description>Actual build of EtherCAT controller</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FMMU_NUM</name>
					<description>FMMUs Supported</description>
					<addressOffset>0x0004</addressOffset>
					<size>8</size>
					<resetValue>0x08</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>NUM_FMMU</name>
							<description>Number of supported FMMU channels (or entities) of the EtherCAT Slave Controller</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYNC_MANAGER</name>
					<description>SyncManagers Supported</description>
					<addressOffset>0x0005</addressOffset>
					<size>8</size>
					<resetValue>0x08</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>NUM_SM</name>
							<description>Number of supported SyncManager channels (or entities) of the EtherCAT Slave Controller</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>RAM_SIZE</name>
					<description>RAM Size</description>
					<addressOffset>0x0006</addressOffset>
					<size>8</size>
					<resetValue>0x08</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RAM_Size</name>
							<description>Process Data RAM size supported by the EtherCAT Slave Controller in KByte</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>PORT_DESC</name>
					<description>Port Descriptor</description>
					<addressOffset>0x0007</addressOffset>
					<size>8</size>
					<resetValue>0x0F</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>Port0</name>
							<description>Port Configuration</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not implemented</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not configured (SII EEPROM)</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>EBUS</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>MII / RMII / RGMII</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Port1</name>
							<description>Port Configuration</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not implemented</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not configured (SII EEPROM)</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>EBUS</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>MII / RMII / RGMII</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Port2</name>
							<description>Port Configuration</description>
							<lsb>4</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not implemented</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not configured (SII EEPROM)</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>EBUS</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>MII / RMII / RGMII</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Port3</name>
							<description>Port Configuration</description>
							<lsb>6</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not implemented</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not configured (SII EEPROM)</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>EBUS</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>MII / RMII / RGMII</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FEATURE</name>
					<description>ESC Features Supported</description>
					<addressOffset>0x0008</addressOffset>
					<size>16</size>
					<resetValue>0x01CC</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>FMMU</name>
							<description>FMMU Operation</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Bit oriented</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Byte oriented</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKS</name>
							<description>Distributed Clocks</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not available</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Available</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKS_W</name>
							<description>Distributed Clocks (width)</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>32 bits</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>64 bits</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LJ_EBUS</name>
							<description>Low Jitter EBUS</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not available, standard jitter</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Available, jitter minimized</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ELD_EBUS</name>
							<description>Enhanced Link Detection EBUS</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not available</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Available</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>ELD_MII</name>
							<description>Enhanced Link Detection MII</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not available</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Available</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SH_FCSE</name>
							<description>Separate Handling of FCS Errors</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not supported</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Supported, frames with wrong FCS and additional nibble will be counted separately in Forwarded RX Error Counter</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EDC_SYNCA</name>
							<description>Enhanced DC SYNC Activation</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Not available</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Available</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LRW_CS</name>
							<description>EtherCAT LRW command support</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Supported</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not supported</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RW_CS</name>
							<description>EtherCAT read/write command support (BRW, APRW, FPRW)</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Supported</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Not supported</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>FX_CONF</name>
							<description>Fixed FMMU/SyncManager configuration</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Variable configuration</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Fixed configuration (refer to documentation of supporting ESCs)</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>STATION_ADR</name>
					<description>Configured Station Address</description>
					<addressOffset>0x0010</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>NODE_ADDR</name>
							<description>Address used for node addressing (FPxx commands)</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATION_ALIAS</name>
					<description>Configured Station Alias</description>
					<addressOffset>0x0012</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>ALIAS_ADDR</name>
							<description>Alias Address used for node addressing(FPxx commands)</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WR_REG_ENABLE</name>
					<description>Write Register Enable</description>
					<addressOffset>0x0020</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>WR_REG_EN</name>
							<description>Write register protection enabled</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>WR_REG_PROTECT</name>
					<description>Write Register Protection</description>
					<addressOffset>0x0021</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>WR_REG_P</name>
							<description>Write register protection</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Protection disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Protection enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ESC_WR_ENABLE</name>
					<description>ESC Write Enable</description>
					<addressOffset>0x0030</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>ESC_WR_PROT</name>
							<description>Write protection enabled</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ESC_WR_PROTECT</name>
					<description>ESC Write Protection</description>
					<addressOffset>0x0031</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>ESC_WR_PROT</name>
							<description>Write protect</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Protection disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Protection enabled</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ESC_RESET_ECAT</name>
					<description>ESC Reset ECAT [WRITE Mode]</description>
					<alternateGroup>WRITEMode</alternateGroup>
					<addressOffset>0x0040</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RESET_CMD</name>
							<description>Reset commands issued by EtherCAt Master</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ESC_RESET_ECAT</name>
					<description>ESC Reset ECAT [READ Mode]</description>
					<alternateGroup>READMode</alternateGroup>
					<addressOffset>0x0040</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RESET_CMD_STATE</name>
							<description>Progress of the reset procedure</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>after writing 0x52</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>after writing 0x45 (if 0x52 was written before)</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>default</description>
									<value>#00</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ESC_RESET_PDI</name>
					<description>ESC Reset PDI [WRITE Mode]</description>
					<alternateGroup>WRITEMode</alternateGroup>
					<addressOffset>0x0041</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RESET_CMD</name>
							<description>Reset commands issued by XMC4700</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ESC_RESET_PDI</name>
					<description>ESC Reset PDI [READ Mode]</description>
					<alternateGroup>READMode</alternateGroup>
					<addressOffset>0x0041</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>RESET_CMD_STATE</name>
							<description>Progress of the reset procedure</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>after writing 0x52</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>after writing 0x45 (if 0x52 was written before)</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>default</description>
									<value>#00</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
