alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4300.svd
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>RECEIVE_TIME_PU[%s]</name>
					<description>Local time of the beginning of a frame</description>
					<addressOffset>0x0918</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RECEIVE_TIME_PU</name>
							<description>Local time of the beginning of a frame</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>DC_SYS_TIME[%s]</name>
					<description>System Time read access</description>
					<alternateGroup>READMode</alternateGroup>
					<addressOffset>0x0910</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>READ_ACCESS</name>
							<description>Read access</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_SYS_TIME</name>
					<description>System Time [WRITE Mode]</description>
					<alternateGroup>WRITEMode</alternateGroup>
					<addressOffset>0x0910</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>WRITE_ACCESS</name>
							<description>Write access</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>write-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>DC_SYS_TIME_OFFSET[%s]</name>
					<description>Difference between local time and System Time</description>
					<addressOffset>0x0920</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DC_SYS_TIME_OFFSET</name>
							<description>Difference between local time and System Time</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_SYS_TIME_DELAY</name>
					<description>System Time Delay</description>
					<addressOffset>0x0928</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLK_DELAY</name>
							<description>Delay between Reference Clock and the ESC</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_SYS_TIME_DIFF</name>
					<description>System Time Difference</description>
					<addressOffset>0x092C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TIME_DIF</name>
							<description>Mean difference between local copy of System Time and received System Time values</description>
							<lsb>0</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>CPY</name>
							<description>Local copy of System Time</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Greater than or equal received System Time</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Smaller than received System Time</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_SPEED_COUNT_START</name>
					<description>Speed Counter Start</description>
					<addressOffset>0x0930</addressOffset>
					<size>16</size>
					<resetValue>0x1000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>COUNT_START</name>
							<description>Bandwidth for adjustment of local copy of System Time</description>
							<lsb>0</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_SPEED_COUNT_DIFF</name>
					<description>Speed Counter Diff</description>
					<addressOffset>0x0932</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>DEVIATION</name>
							<description>Representation of the deviation between local clock period and Reference Clock's clock period</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_SYS_TIME_FIL_DEPTH</name>
					<description>System Time Difference Filter Depth</description>
					<addressOffset>0x0934</addressOffset>
					<size>8</size>
					<resetValue>0x04</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>FILTER_DEPTH</name>
							<description>Filter depth for averaging the received System Time deviation</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_SPEED_COUNT_FIL_DEPTH</name>
					<description>Speed Counter Filter Depth</description>
					<addressOffset>0x0935</addressOffset>
					<size>8</size>
					<resetValue>0x0C</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>FILTER_DEPTH</name>
							<description>Filter depth for averaging the clock period deviation</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_CYC_CONT</name>
					<description>Cyclic Unit Control</description>
					<addressOffset>0x0980</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>SYNC</name>
							<description>SYNC out unit control</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>ECAT controlled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>PDI controlled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LATCH_U0</name>
							<description>Latch In unit 0</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>ECAT controlled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>PDI controlled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LATCH_U1</name>
							<description>Latch In unit 1</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>ECAT controlled</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>PDI controlled</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_ACT</name>
					<description>Activation register</description>
					<addressOffset>0x0981</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>SYNC_OUT</name>
							<description>Sync Out Unit activation</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Deactivated</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Activated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNC_0</name>
							<description>SYNC0 generation</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Deactivated</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>SYNC0 pulse is generated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SYNC_1</name>
							<description>SYNC1 generation</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Deactivated</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>SYNC1 pulse is generated</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_PULSE_LEN</name>
					<description>Pulse Length of SyncSignals</description>
					<addressOffset>0x0982</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0x0000</resetMask>
					<fields>
						<field>
							<name>PULS_LENGTH</name>
							<description>Pulse length of SyncSignals</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Acknowledge mode: SyncSignal will be cleared by reading SYNC[1:0] Status register</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_ACT_STAT</name>
					<description>Activation Status</description>
					<addressOffset>0x0984</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>S0_ACK_STATE</name>
							<description>SYNC0 activation state</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>First SYNC0 pulse is not pending</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>First SYNC0 pulse is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S1_ACK_STATE</name>
							<description>SYNC1 activation state</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>First SYNC1 pulse is not pending</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>First SYNC1 pulse is pending</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>S_TIME</name>
							<description>Start Time Cyclic Operation</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Start Time was within near future</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Start Time was out of near future (0x0981.6)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_SYNC0_STAT</name>
					<description>SYNC0 Status</description>
					<addressOffset>0x098E</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>S0_STATE</name>
							<description>SYNC0 state for Acknowledge mode</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_SYNC1_STAT</name>
					<description>SYNC1 Status</description>
					<addressOffset>0x098F</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>S1_STATE</name>
							<description>SYNC1 state for Acknowledge mode</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>DC_CYC_START_TIME[%s]</name>
					<description>Start Time Cyclic Operation</description>
					<addressOffset>0x0990</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DC_CYC_START_TIME</name>
							<description>Start Time Cyclic Operation</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>DC_NEXT_SYNC1_PULSE[%s]</name>
					<description>System time of next SYNC1 pulse in ns</description>
					<addressOffset>0x0998</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DC_NEXT_SYNC1_PULSE</name>
							<description>System time of next SYNC1 pulse in ns</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_SYNC0_CYC_TIME</name>
					<description>SYNC0 Cycle Time</description>
					<addressOffset>0x09A0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TIME_BETWEEN_SYNC0</name>
							<description>Time between two consecutive SYNC0 pulses</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Single shot mode, generate only one SYNC0 pulse</description>
									<value>0b0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_SYNC1_CYC_TIME</name>
					<description>SYNC1 Cycle Time</description>
					<addressOffset>0x09A4</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TIME_SYNC1_SYNC0</name>
							<description>Time between SYNC1 pulses and SYNC0 pulse</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_LATCH0_CONT</name>
					<description>Latch0 Control</description>
					<addressOffset>0x09A8</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>L0_POS</name>
							<description>Latch0 positive edge</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Continuous Latch active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Single event (only first event active)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>L0_NEG</name>
							<description>Latch0 negative edge</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Continuous Latch active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Single event (only first event active)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_LATCH1_CONT</name>
					<description>Latch1 Control</description>
					<addressOffset>0x09A9</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>L1_POS</name>
							<description>Latch1 positive edge</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Continuous Latch active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Single event (only first event active)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>L1_NEG</name>
							<description>Latch1 negative edge</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Continuous Latch active</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Single event (only first event active)</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_LATCH0_STAT</name>
					<description>Latch0 Status</description>
					<addressOffset>0x09AE</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0x00</resetMask>
					<fields>
						<field>
							<name>EV_L0_POS</name>
							<description>Event Latch0 positive edge</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Positive edge not detected or continuous mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Positive edge detected in single event mode only</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EV_L0_NEG</name>
							<description>Event Latch0 negative edge</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Negative edge not detected or continuous mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Negative edge detected in single event mode only</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>L0_PIN</name>
							<description>Latch0 pin state</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_LATCH1_STAT</name>
					<description>Latch1 Status</description>
					<addressOffset>0x09AF</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0x00</resetMask>
					<fields>
						<field>
							<name>EV_L1_POS</name>
							<description>Event Latch1 positive edge</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Positive edge not detected or continuous mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Positive edge detected in single event mode only</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EV_L1_NEG</name>
							<description>Event Latch1 negative edge</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Negative edge not detected or continuous mode</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Negative edge detected in single event mode only</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>L1_PIN</name>
							<description>Latch1 pin state</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>DC_LATCH0_TIME_POS[%s]</name>
					<description>Register captures System time at the positive edge of the Latch0 signal</description>
					<addressOffset>0x09B0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DC_LATCH0_TIME_POS</name>
							<description>Captures System time at the positive edge of the Latch0 signal</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>DC_LATCH0_TIME_NEG[%s]</name>
					<description>Register captures System time at the negative edge of the Latch0 signal</description>
					<addressOffset>0x09B8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DC_LATCH0_TIME_NEG</name>
							<description>Captures System time at the negative edge of the Latch0 signal</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
