alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4300.svd
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>DC_LATCH1_TIME_POS[%s]</name>
					<description>Register captures System time at the positive edge of the Latch1 signal</description>
					<addressOffset>0x09C0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DC_LATCH1_TIME_POS</name>
							<description>Captures System time at the positive edge of the Latch1 signal</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<dim>2</dim>
					<dimIncrement>4</dimIncrement>
					<name>DC_LATCH1_TIME_NEG[%s]</name>
					<description>Register captures System time at the negative edge of the Latch1 signal</description>
					<addressOffset>0x09C8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DC_LATCH1_TIME_NEG</name>
							<description>Captures System time at the negative edge of the Latch1 signal</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_ECAT_CNG_EV_TIME</name>
					<description>EtherCAT Buffer Change Event Time</description>
					<addressOffset>0x09F0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ECAT_CNG_EV_TIME</name>
							<description>Register captures local time of the beginning of the frame which causes at least one SyncManager to assert an ECAT event</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_PDI_START_EV_TIME</name>
					<description>PDI Buffer Start Event Time</description>
					<addressOffset>0x09F8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PDI_START_EV_TIME</name>
							<description>Register captures local time when at least one SyncManager asserts an PDI buffer start event</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DC_PDI_CNG_EV_TIME</name>
					<description>PDI Buffer Change Event Time</description>
					<addressOffset>0x09FC</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PDI_CNG_EV_TIME</name>
							<description>Register captures local time when at least one SyncManager asserts an PDI buffer change event</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ID</name>
					<description>ECAT0 Module ID</description>
					<addressOffset>0x0E00</addressOffset>
					<size>32</size>
					<resetValue>0x0093C001</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MOD_REV</name>
							<description>Module Revision Number</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_TYPE</name>
							<description>Module Type</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>MOD_NUMBER</name>
							<description>Module Number Value</description>
							<lsb>16</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>STATUS</name>
					<description>ECAT0 Status</description>
					<addressOffset>0x0E08</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PARERR</name>
							<description>PARITY ERROR</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No Error</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Parity Error in User or Process RAM</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>ECAT0_FMMU0</name>
			<description>EtherCAT 0</description>
			<groupName>ECAT</groupName>
			<headerStructName>ECAT0_FMMU</headerStructName>
			<baseAddress>0x54010600</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x10</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>FMMU_L_START_ADR</name>
					<description>Logical Start address FMMU</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>L_START_ADDR</name>
							<description>Logical start address within the EtherCAT Address Space</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FMMU_LEN</name>
					<description>Length FMMU 0</description>
					<addressOffset>0x04</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>OFFSET</name>
							<description>Offset from the first logical FMMU Byte to the last FMMU Byte + 1</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FMMU_L_START_BIT</name>
					<description>Start bit FMMU 0 in logical address space</description>
					<addressOffset>0x06</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>L_START_BIT</name>
							<description>Logical starting bit that shall be mapped</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FMMU_L_STOP_BIT</name>
					<description>Stop bit FMMU 0 in logical address space</description>
					<addressOffset>0x07</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>L_STOP_BIT</name>
							<description>Last logical bit that shall be mapped</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FMMU_P_START_ADR</name>
					<description>Ph0sical Start address FMMU y</description>
					<addressOffset>0x08</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>P_START_ADDR</name>
							<description>Physical Start Address</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FMMU_P_START_BIT</name>
					<description>Ph0sical Start bit FMMU y</description>
					<addressOffset>0x0A</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>P_START_BIT</name>
							<description>Physical starting bit as target of logical start bit mapping</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>FMMU_TYPE</name>
					<description>T0pe FMMU y</description>
					<addressOffset>0x0B</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>R_ACC</name>
							<description>Read Access</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Ignore mapping for read accesses</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Use mapping for read accesses</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>W_ACC</name>
							<description>Write Access</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Ignore mapping for write accesses</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Use mapping for write accesses</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>FMMU_ACT</name>
					<description>Activate FMMU 0</description>
					<addressOffset>0x0C</addressOffset>
					<size>8</size>
					<resetValue>0x00</resetValue>
					<resetMask>0xFF</resetMask>
					<fields>
						<field>
							<name>ACT</name>
							<description>FMMU Activation</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>FMMU deactivated.</description>
									<value>0b0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>FMMU activated. FMMU checks logical addressed blocks to be mapped according to mapping configured</description>
									<value>0b1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
