alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4300.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>USB0_EP0</name>
			<description>Universal Serial Bus</description>
			<groupName>USB</groupName>
			<baseAddress>0x50040900</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0400</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>DIEPCTL0</name>
					<description>Device Control IN Endpoint Control Register</description>
					<addressOffset>0x000</addressOffset>
					<size>32</size>
					<resetValue>0x00008000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MPS</name>
							<description>Maximum Packet Size</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>64 bytes</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>32 bytes</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>16 bytes</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 bytes</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USBActEP</name>
							<description>USB Active Endpoint</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NAKSts</name>
							<description>NAK Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The core is transmitting non-NAK handshakes based on the FIFO status</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The core is transmitting NAK handshakes on this endpoint.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPType</name>
							<description>Endpoint Type</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>Stall</name>
							<description>STALL Handshake</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TxFNum</name>
							<description>TxFIFO Number</description>
							<lsb>22</lsb>
							<msb>25</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNAK</name>
							<description>Clear NAK</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SNAK</name>
							<description>Set NAK</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>EPDis</name>
							<description>Endpoint Disable</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPEna</name>
							<description>Endpoint Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPINT0</name>
					<description>Device Endpoint Interrupt Register</description>
					<addressOffset>0x008</addressOffset>
					<size>32</size>
					<resetValue>0x00000080</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XferCompl</name>
							<description>Transfer Completed Interrupt</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPDisbld</name>
							<description>Endpoint Disabled Interrupt</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AHBErr</name>
							<description>AHB Error</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TimeOUT</name>
							<description>Timeout Condition</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INTknTXFEmp</name>
							<description>IN Token Received When TxFIFO is Empty</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>INEPNakEff</name>
							<description>IN Endpoint NAK Effective</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>TxFEmp</name>
							<description>Transmit FIFO Empty</description>
							<lsb>7</lsb>
							<msb>7</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>BNAIntr</name>
							<description>BNA (Buffer Not Available) Interrupt</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPTSIZ0</name>
					<description>Device IN Endpoint Transfer Size Register</description>
					<addressOffset>0x010</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XferSize</name>
							<description>Transfer Size</description>
							<lsb>0</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PktCnt</name>
							<description>Packet Count</description>
							<lsb>19</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPDMA0</name>
					<description>Device Endpoint DMA Address Register</description>
					<addressOffset>0x014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DMAAddr</name>
							<description>DMA Address</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DTXFSTS0</name>
					<description>Device IN Endpoint Transmit FIFO Status Register</description>
					<addressOffset>0x018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>INEPTxFSpcAvail</name>
							<description>IN Endpoint TxFIFO Space Avail</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Endpoint TxFIFO is full</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1 word available</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>2 words available</description>
									<value>0x2</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DIEPDMAB0</name>
					<description>Device Endpoint DMA Buffer Address Register</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DMABufferAddr</name>
							<description>DMA Buffer Address</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DOEPCTL0</name>
					<description>Device Control OUT Endpoint Control Register</description>
					<addressOffset>0x200</addressOffset>
					<size>32</size>
					<resetValue>0x00008000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>MPS</name>
							<description>Maximum Packet Size</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>64 bytes</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>32 bytes</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>16 bytes</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>8 bytes</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USBActEP</name>
							<description>USB Active Endpoint</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NAKSts</name>
							<description>NAK Status</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The core is transmitting non-NAK handshakes based on the FIFO status.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The core is transmitting NAK handshakes on this endpoint.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>EPType</name>
							<description>Endpoint Type</description>
							<lsb>18</lsb>
							<msb>19</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>Snp</name>
							<description>Snoop Mode</description>
							<lsb>20</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Stall</name>
							<description>STALL Handshake</description>
							<lsb>21</lsb>
							<msb>21</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNAK</name>
							<description>Clear NAK</description>
							<lsb>26</lsb>
							<msb>26</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>SNAK</name>
							<description>Set NAK</description>
							<lsb>27</lsb>
							<msb>27</msb>
							<access>write-only</access>
						</field>
						<field>
							<name>EPDis</name>
							<description>Endpoint Disable</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>EPEna</name>
							<description>Endpoint Enable</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DOEPINT0</name>
					<description>Device Endpoint Interrupt Register</description>
					<addressOffset>0x208</addressOffset>
					<size>32</size>
					<resetValue>0x00000080</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XferCompl</name>
							<description>Transfer Completed Interrupt</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>EPDisbld</name>
							<description>Endpoint Disabled Interrupt</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>AHBErr</name>
							<description>AHB Error</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SetUp</name>
							<description>SETUP Phase Done</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>OUTTknEPdis</name>
							<description>OUT Token Received When Endpoint Disabled</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>StsPhseRcvd</name>
							<description>Status Phase Received For Control Write</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>Back2BackSETup</name>
							<description>Back-to-Back SETUP Packets Received</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BNAIntr</name>
							<description>BNA (Buffer Not Available) Interrupt</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PktDrpSts</name>
							<description>Packet Dropped Status</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>BbleErrIntrpt</name>
							<description>BbleErr (Babble Error) interrupt</description>
							<lsb>12</lsb>
							<msb>12</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NAKIntrpt</name>
							<description>NAK interrupt</description>
							<lsb>13</lsb>
							<msb>13</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>NYETIntrpt</name>
							<description>NYET interrupt</description>
							<lsb>14</lsb>
							<msb>14</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DOEPTSIZ0</name>
					<description>Device OUT Endpoint Transfer Size Register</description>
					<addressOffset>0x210</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>XferSize</name>
							<description>Transfer Size</description>
							<lsb>0</lsb>
							<msb>6</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PktCnt</name>
							<description>Packet Count</description>
							<lsb>19</lsb>
							<msb>20</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>SUPCnt</name>
							<description>SETUP Packet Count</description>
							<lsb>29</lsb>
							<msb>30</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 packet</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 packets</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>3 packets</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DOEPDMA0</name>
					<description>Device Endpoint DMA Address Register</description>
					<addressOffset>0x214</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<readAction>modifyExternal</readAction>
					<fields>
						<field>
							<name>DMAAddr</name>
							<description>DMA Address</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>DOEPDMAB0</name>
					<description>Device Endpoint DMA Buffer Address Register</description>
					<addressOffset>0x21C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>DMABufferAddr</name>
							<description>DMA Buffer Address</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
