alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC4300.svd
				<register>
					<name>CEVNP0</name>
					<description>Channel Event Node Pointer Register 0</description>
					<addressOffset>0x01A0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CEV0NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CEV1NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CEV2NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CEV3NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CEV4NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CEV5NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CEV6NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CEV7NP</name>
							<description>Service Request Node Pointer Channel Event i</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>REVNP0</name>
					<description>Result Event Node Pointer Register 0</description>
					<addressOffset>0x01B0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>REV0NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV1NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV2NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV3NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV4NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV5NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV6NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>24</lsb>
							<msb>27</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>REV7NP</name>
							<description>Service Request Node Pointer Result Event i</description>
							<lsb>28</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select service request line 0 of group x</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select service request line 3 of group x</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select shared service request line 0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select shared service request line 3</description>
									<value>#0111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
